package cn.chinotan.zeus.framework.common.api;

/**
 * <p>
 * REST API 响应码
 * </p>
 *
 * @author xingcheng
 * @since 2018-11-08
 */
public enum ApiCode {

    /**
     * 操作成功
     **/
    SUCCESS(200, "操作成功"),
    /**
     * 非法访问
     **/
    UNAUTHORIZED(401, "非法访问"),
    /**
     * 没有权限
     **/
    NOT_PERMISSION(403, "没有权限"),
    /**
     * 你请求的资源不存在
     **/
    NOT_FOUND(404, "你请求的资源不存在"),
    /**
     * 操作失败
     **/
    FAIL(500, "操作失败"),
    /**
     * 登录失败
     **/
    LOGIN_EXCEPTION(4000, "登录失败"),
    /**
     * 系统异常
     **/
    SYSTEM_EXCEPTION(5000, "系统异常"),
    /**
     * 请求参数校验异常
     **/
    PARAMETER_EXCEPTION(5001, "请求参数校验异常"),
    /**
     * 请求参数解析异常
     **/
    PARAMETER_PARSE_EXCEPTION(5002, "请求参数解析异常"),
    /**
     * HTTP内容类型异常
     **/
    HTTP_MEDIA_TYPE_EXCEPTION(5003, "HTTP内容类型异常"),
    /**
     * 系统处理异常
     **/
    zeus_EXCEPTION(5100, "系统处理异常"),
    /**
     * 业务处理异常
     **/
    BUSINESS_EXCEPTION(5101, "业务处理异常"),
    /**
     * 数据库处理异常
     **/
    DAO_EXCEPTION(5102, "数据库处理异常"),
    /**
     * 验证码校验异常
     **/
    VERIFICATION_CODE_EXCEPTION(5103, "验证码校验异常"),
    /**
     * 登录授权异常
     **/
    AUTHENTICATION_EXCEPTION(5104, "登录授权异常"),
    /**
     * 没有访问权限
     **/
    UNAUTHENTICATED_EXCEPTION(5105, "没有访问权限"),
    /**
     * 没有访问权限
     **/
    UNAUTHORIZED_EXCEPTION(5106, "没有访问权限"),
    /**
     * JWT Token解析异常
     **/
    JWTDECODE_EXCEPTION(5107, "Token解析异常"),

    HTTP_REQUEST_METHOD_NOT_SUPPORTED_EXCEPTION(5108, "METHOD NOT SUPPORTED"),


    /**
     * 抽奖相关
     */
    ERROR_6100(6100, "抽奖活动不存在！"),
    ERROR_6101(6101, "抽奖活动id不存在！"),
    ERROR_6102(6102, "抽奖活动已结束，可以尝试其他活动哟(＾Ｕ＾)ノ~ＹＯ！"),
    ERROR_6103(6103, "您已参与过此抽奖活动，可参与其他活动哟(＾Ｕ＾)ノ~ＹＯ！"),
    ERROR_6104(6104, "您没有参与过此抽奖活动，请联系客服确认哟(＾Ｕ＾)ノ~ＹＯ！"),
    ERROR_6105(6105, "您已经领取过此奖品，无法重复领取哟(＾Ｕ＾)ノ~ＹＯ！"),
    ERROR_6106(6106, "抽奖活动还没开奖，请开奖后查看领取哟(＾Ｕ＾)ノ~ＹＯ！"),

    /**
     * 分享相关
     */
    ERROR_6200(6200, "分享记录不存在！"),
    ERROR_6201(6201, "分享记录对应的用户不是你哦，请重新分享！"),
    ERROR_6203(6203, "您已经领取过分享红包了，可以重新分享再次领取哦！"),
    ERROR_6204(6203, "您的分享红包已过期，可以重新分享再次领取哦！"),

    /**
     * 账户相关
     */
    ERROR_6300(6300, "账户金额为负数，请联系客服确认！"),
    ERROR_6301(6301, "账户未开户，请联系客服确认！"),
    ERROR_6302(6302, "{}元以上就能提取，快去抽奖领现金吧~"),
    INFO_6303(6303, "提现申请成功，到账时间请关注服务通知~"),
    ERROR_6304(6304, "请允许获取手机号权限，才可以进行提现哦~"),
    ERROR_6305(6305, "提现失败，请稍后再试哦~"),
    ERROR_6306(6306, "提现失败，请稍后重新发起提现~"),
    ERROR_6307(6307, "提现失败，商户API证书校验出错~"),
    ERROR_6308(6308, "提现失败，请求已受理，稍后查询~"),
    ERROR_6309(6309, "提现失败，红包已经发放失败~"),
    ERROR_6310(6310, "提现上限不超过{}元"),

    /**
     * 用户相关
     */
    ERROR_6400(6400, "用户不存在，请联系客服确认！"),
    ERROR_6401(6401, "授权登陆appId不合法，请联系客服确认！"),
    ERROR_6402(6402, "授权登陆获取信息失败，请联系客服确认！"),
    ERROR_6403(6403, "用户openId为空，请联系客服确认！"),
    ERROR_6404(6404, "appId配置有误，请联系客服确认！"),
    ERROR_6405(6405, "请关注公众号才能登陆哦！"),
    ERROR_6406(6406, "unionId无法获取，请联系客服确认！"),
    ERROR_6407(6407, "获取头像等信息出错，请联系客服确认！"),
    ERROR_6408(6308, "提现appId配置有误，请联系客服确认！"),
    ERROR_6409(6309, "三方用户信息不存在，请联系客服确认！"),
    ERROR_6410(6309, "三方用户信息异常，请联系客服确认！"),
    ERROR_6411(6311, "获取加密数据异常，请联系客服确认！"),
    ERROR_6412(6312, "获取的手机号为空，请联系客服确认！"),
    ERROR_6413(6313, "微信登录校验失败，请稍后再试！"),
    ERROR_6414(6314, "微信登录code不能为空，请稍后再试！"),
    ERROR_6415(6315, "获取三方签名参数为空，请稍后再试！"),

    /**
     * 用户地址相关
     */
    ERROR_6500(6500, "用户地址不存在，请联系客服确认！"),
    ERROR_6501(6501, "用户地址id不能为空，请联系客服确认！"),

    /**
     * OSS
     */
    CODE_100200(100200, "上传文件格式有误！"),

    /**
     * config
     */
    CODE_100500(100500, "config不存在！"),

    /**
     * 抽奖活动
     */
    CODE_100000(100000, "抽奖活动id不能为空"),
    CODE_100001(100001, "抽奖活动不存在"),
    CODE_100002(100002, "抽奖活动非待开启状态，无法上架！"),
    CODE_100003(100003, "抽奖活动开奖时间已过，无法上架！"),
    CODE_100004(100004, "抽奖活动实物奖品必须设置单个奖品成本！"),
    CODE_100005(100005, "抽奖活动开奖时间不得小于当前时间！"),

    /**
     * ECPM
     */
    CODE_100100(100100, "ECPM配置不存在"),
    CODE_100101(100101, "10点后不可编辑ECPM配置"),

    /**
     * 账户
     */
    CODE_100300(100300, "提现appId配置有误，请联系客服确认！"),
    CODE_100301(100301, "提现失败，请稍后再试哦~"),
    CODE_100302(100302, "提现失败，商户API证书校验出错~"),
    CODE_100303(100303, "提现失败，请求已受理，稍后查询~"),
    CODE_100304(100304, "提现失败，红包已经发放失败~"),

    /**
     * 用户
     */
    CODE_100400(100400, "用户openId为空，请联系客服确认！"),


    /**
     * 用户账户提现审核
     */
    CODE_100600(100600, "用户账户提现审核不存在！"),
    CODE_100601(100601, "用户账户提现审核非待审核状态，请刷新后查看！"),
    CODE_100602(100602, "用户账户记录不合法！"),
    
    ;

    private final int code;
    private final String message;

    ApiCode(final int code, final String message) {
        this.code = code;
        this.message = message;
    }

    public static ApiCode getApiCode(int code) {
        ApiCode[] ecs = ApiCode.values();
        for (ApiCode ec : ecs) {
            if (ec.getCode() == code) {
                return ec;
            }
        }
        return SUCCESS;
    }

    public int getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }

    public String getMsg() {
        return message;
    }
}
